questions = [
    {
        "question": "การกดขี่โดยบริษัทน่าเป็นกังวลมากกว่าการกดขี่โดยรัฐบาล",
        "effect": {
            "econ": 10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "เป็นเรื่องจำเป็นที่รัฐบาลจะต้องแทรกแซงในเศรษฐกิจเพื่อปกป้องผู้บริโภค",
        "effect": {
            "econ": 10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "ตลาดยิ่งมีความเสรีเท่าใด ผู้คนก็ยิ่งมีความเสรีเท่านั้น",
        "effect": {
            "econ": -10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "การจัดสรรงบประมาณที่สมดุลย่อมดีกว่าการจัดสวัสดิการที่ดีให้พลเมืองทุกคน",
        "effect": {
            "econ": -10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "การค้นคว้าวิจัยของรัฐมีประโยชน์มากกว่าการค้นคว้าวิจัยโดยตลาด",
        "effect": {
            "econ": 10,
            "dipl": 0,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "ภาษีศุลกากรในการนำเข้าเป็นสิ่งสำคัญที่ช่วยจูงใจให้เกิดการผลิตในประเทศ",
        "effect": {
            "econ": 5,
            "dipl": 0,
            "govt": -10,
            "scty": 0
        }
    },
    {
        "question": "ทุกคนทำงานตามความสามารถ แล้วนำผลผลิตที่ได้มาจัดสรรตามความจำเป็นของแต่ละคน",
        "effect": {
            "econ": 10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "จะดีที่สุดถ้ายกเลิกระบบสังคมสงเคราะห์โดยรัฐ แล้วหันมาพึ่งพาการบริจาคภาคเอกชนทั้งหมด",
        "effect": {
            "econ": -10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "ควรเก็บภาษีคนรวยให้มากกว่านี้เพื่อเอามาสงเคราะห์คนจน",
        "effect": {
            "econ": 10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "มรดกตกทอดถือเป็นทรัพย์สมบัติที่ถูกทำนองคลองธรรม",
        "effect": {
            "econ": -10,
            "dipl": 0,
            "govt": 0,
            "scty": -5
        }
    },
    {
        "question": "รัฐควรเป็นเจ้าของระบบ‎สาธารณูปโภคเช่น ถนนและไฟฟ้า",
        "effect": {
            "econ": 10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "การแทรกแซงของรัฐถือเป็นภัยต่อเศรษฐกิจ",
        "effect": {
            "econ": -10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "ใครที่สามารถจ่ายเงินได้มากกว่า ก็ควรได้รับการบริการทางการแพทย์ที่ดีกว่า",
        "effect": {
            "econ": -10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "การเข้าถึงการศึกษาที่มีคุณภาพควรเป็นสิทธิของทุกคน",
        "effect": {
            "econ": 10,
            "dipl": 0,
            "govt": 0,
            "scty": 5
        }
    },
    {
        "question": "ปัจจัยการผลิตควรเป็นของผู้ใช้แรงงาน",
        "effect": {
            "econ": 10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "ควรยุบองค์การสหประชาชาติทิ้ง",
        "effect": {
            "econ": 0,
            "dipl": -10,
            "govt": -5,
            "scty": 0
        }
    },
    {
        "question": "การปฏิบัติการทางทหารโดยชาติของเรา ถือเป็นสิ่งจำเป็นในการที่จะปกปักรักษาชาติของเราไว้",
        "effect": {
            "econ": 0,
            "dipl": -10,
            "govt": -10,
            "scty": 0
        }
    },
    {
        "question": "ข้าพเจ้าสนับสนุนองค์การสหภาพระดับภูมิภาค เช่น สหภาพยุโรป",
        "effect": {
            "econ": -5,
            "dipl": 10,
            "govt": 10,
            "scty": 5
        }
    },
    {
        "question": "การปกปักรักษาไว้ซึ่งเอกราชของชาติเราเป็นสิ่งสำคัญ",
        "effect": {
            "econ": 0,
            "dipl": -10,
            "govt": -5,
            "scty": 0
        }
    },
    {
        "question": "การมีรัฐบาลแห่งโลกจะสร้างคุณประโยชน์ต่อมวลมนุษยชาติ",
        "effect": {
            "econ": 0,
            "dipl": 10,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "การรักษาความสัมพันธ์อันดีระหว่างประเทศเป็นสิ่งที่สำคัญกว่าการสร้างความแข็งแกร่งของชาติเรา",
        "effect": {
            "econ": 0,
            "dipl": 10,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "การศึกสงครามไม่จำเป็นต้องให้เหตุผลใดๆต่อชาติอื่นๆ",
        "effect": {
            "econ": 0,
            "dipl": -10,
            "govt": -10,
            "scty": 0
        }
    },
    {
        "question": "ค่าใช้จ่ายทางทหารถือเป็นความสิ้นเปลือง",
        "effect": {
            "econ": 0,
            "dipl": 10,
            "govt": 10,
            "scty": 0
        }
    },
    {
        "question": "เงินช่วยเหลือระหว่างประเทศถือเป็นความสิ้นเปลือง",
        "effect": {
            "econ": -5,
            "dipl": -10,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "ชาติของข้าพเจ้ายิ่งใหญ่",
        "effect": {
            "econ": 0,
            "dipl": -10,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "งานวิจัยต่างๆควรเกิดขึ้นในระดับนานาชาติ",
        "effect": {
            "econ": 0,
            "dipl": 10,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "รัฐบาลของแต่ละประเทศควรต้องแสดงความรับผิดชอบต่อประชาคมโลก",
        "effect": {
            "econ": 0,
            "dipl": 10,
            "govt": 5,
            "scty": 0
        }
    },
    {
        "question": "แม้จะเป็นการประท้วงรัฐบาลเผด็จการก็ตาม หากผู้ประท้วงใช้ความรุนแรงก็ถือเป็นสิ่งที่ไม่อาจยอมรับได้",
        "effect": {
            "econ": 0,
            "dipl": 5,
            "govt": -5,
            "scty": 0
        }
    },
    {
        "question": "คำสอนศาสนาที่ข้าพเจ้านับถือควรถูกเผยแพร่ไปให้มากที่สุดเท่าที่จะมากได้",
        "effect": {
            "econ": 0,
            "dipl": -5,
            "govt": -10,
            "scty": -10
        }
    },
    {
        "question": "ค่านิยมของชาติเราควรถูกเผยแพร่ออกไปให้มากที่สุดเท่าที่จะมากได้",
        "effect": {
            "econ": 0,
            "dipl": -10,
            "govt": -5,
            "scty": 0
        }
    },
    {
        "question": "เป็นสิ่งสำคัญอย่างยิ่งที่จะรักษาไว้ซึ่งกฎหมายและคำสั่ง ( law and order )",
        "effect": {
            "econ": 0,
            "dipl": -5,
            "govt": -10,
            "scty": -5
        }
    },
    {
        "question": "ประชาชนส่วนใหญ่มีการตัดสินใจที่แย่",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -10,
            "scty": 0
        }
    },
    {
        "question": "อาชญากรรมที่ปราศจากผู้เสียหาย (เช่น การใช้สารเสพย์ติด) ไม่ควรถือว่าเป็นอาชญากรรมด้วยซ้ำไป",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 10,
            "scty": 0
        }
    },
    {
        "question": "จำเป็นจะต้องมีการเสียสละสิทธิพลเมืองบางอย่างในการปกป้องเราจากการก่อการร้าย",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -10,
            "scty": 0
        }
    },
    {
        "question": "การสอดแนมมวลชนโดยรัฐ (Government Survelliance)เป็นสิ่งจำเป็นในโลกยุคใหม่",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -10,
            "scty": 0
        }
    },
    {
        "question": "การมีอยู่ของรัฐถือเป็นภัยคุกคามต่อเสรีภาพของเรา",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 10,
            "scty": 0
        }
    },
    {
        "question": "ไม่ว่าจะมีความคิดเห็นทางการเมืองแบบใด ก็ควรเข้าข้างชาติตัวเอง",
        "effect": {
            "econ": 0,
            "dipl": -10,
            "govt": -10,
            "scty": -5
        }
    },
    {
        "question": "การตั้งคำถามต่ออำนาจทุกชนิดเป็นสิ่งที่ควรกระทำ",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 10,
            "scty": 5
        }
    },
    {
        "question": "รัฐที่มีโครงสร้างเป็นลำดับชั้น (hierarchical state)ดีที่สุด",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -10,
            "scty": 0
        }
    },
    {
        "question": "การที่รัฐบาลปฏิบัติตามมติเสียงข้างมากแม้ในเรื่องที่ผิด ถือเป็นสิ่งที่สำคัญ",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 10,
            "scty": 0
        }
    },
    {
        "question": "ผู้นำยิ่งเข้มแข็งยิ่งดี",
        "effect": {
            "econ": 0,
            "dipl": -10,
            "govt": -10,
            "scty": 0
        }
    },
    {
        "question": "ประชาธิปไตยเป็นมากกว่าแค่กระบวนการตัดสินใจกระบวนการหนึ่ง",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 10,
            "scty": 0
        }
    },
    {
        "question": "มาตรการด้านการรักษาสิ่งแวดล้อมเป็นสิ่งสำคัญ",
        "effect": {
            "econ": 5,
            "dipl": 0,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "โลกที่ดีกว่านี้จะเกิดขึ้นจากเครื่องจักรอัตโนมัติ(AI) วิทยาศาสตร์ และเทคโนโลยี",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "เด็กๆควรได้รับปลูกฝังค่านิยมด้านศาสนาและค่านิยมดั้งเดิมของเรา",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -5,
            "scty": -10
        }
    },
    {
        "question": "ขนบธรรมเนียมประเพณี (Traditions) ไม่ได้มีคุณค่าในตัวของมันเอง",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "ศาสนาควรมีบทบาทในรัฐบาล",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -10,
            "scty": -10
        }
    },
    {
        "question": "วัดควรต้องเสียภาษีเข้ารัฐเช่นเดียวกับสถาบันอื่นๆ",
        "effect": {
            "econ": 5,
            "dipl": 0,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "การเปลี่ยนแปลงสภาพภูมิอากาศ (ภาวะโลกร้อน) ถือเป็นหนึ่งในภัยคุกคามที่ร้ายแรงที่สุดต่อวิถีชีวิตของเรา",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "เป็นสิ่งสำคัญที่ทั้งโลกจะจับมือกันเพื่อรับมือกับการเปลี่ยนแปลงสภาพภูมิอากาศ (ภาวะโลกร้อน)",
        "effect": {
            "econ": 0,
            "dipl": 10,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "สังคมแต่ก่อนดีกว่าปัจจุบัน",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 0,
            "scty": -10
        }
    },
    {
        "question": "เป็นสิ่งสำคัญที่เราจะรักษาไว้ซึ่งขนบธรรมเนียมประเพณีดั้งเดิมในอดีตของเรา",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 0,
            "scty": -10
        }
    },
    {
        "question": "เป็นสิ่งสำคัญที่เราจะคิดการณ์ไกล มองไกลเกินอายุขัยของตัวเอง",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "เหตุและผลสำคัญกว่าการรักษาวัฒนธรรมของเรา",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "การเสพย์สารเสพย์ติดควรเป็นสิ่งถูกกฎหมาย หรือไม่มีโทษทางอาญาไปเลย",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 10,
            "scty": 2
        }
    },
    {
        "question": "การสมรสเพศเดียวกันควรเป็นสิ่งถูกกฎหมาย",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 10,
            "scty": 10
        }
    },
    {
        "question": "ไม่มีวัฒนธรรมใดที่เหนือกว่าวัฒนธรรมอื่น",
        "effect": {
            "econ": 0,
            "dipl": 10,
            "govt": 5,
            "scty": 10
        }
    },
    {
        "question": "เพศสัมพันธ์นอกสมรสเป็นสิ่งที่ผิดศีลธรรม",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -5,
            "scty": -10
        }
    },
    {
        "question": "ถ้าเรารับผู้อพยพ สิ่งสำคัญที่พวกเขาต้องทำคือ ยอมถูกกลืนกลายทางวัฒนธรรม หันมาเรียนรู้และปฏิบัติตามวัฒนธรรมของเรา",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -5,
            "scty": -10
        }
    },
    {
        "question": "การทำแท้งควรเป็นสิ่งที่ผิดกฎหมายทุกกรณี  หรือเว้นแต่บางกรณีเท่านั้น",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -10,
            "scty": -10
        }
    },
    {
        "question": "กฎหมายควรห้ามการครอบครองอาวุธปืนสำหรับคนที่ไม่มีความจำเป็นจริงๆ",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -10,
            "scty": 0
        }
    },
    {
        "question": "ข้าพเจ้าสนับสนุนระบบสวัสดิการการรักษาพยาบาลถ้วนหน้าโดยรัฐ",
        "effect": {
            "econ": 10,
            "dipl": 0,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "การค้าโสเภณีควรเป็นสิ่งผิดกฎหมาย",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": -10,
            "scty": -10
        }
    },
    {
        "question": "การรักษาคุณค่าสถาบันครอบครัวเป็นสิ่งจำเป็น",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 0,
            "scty": -10
        }
    },
    {
        "question": "การยอมแลกทุกอย่างเพื่อความเจริญก้าวหน้าเป็นสิ่งที่อันตราย",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 0,
            "scty": -10
        }
    },
    {
        "question": "การตัดต่อพันธุกรรมเป็นสิ่งที่มีคุณมหันต์ แม้กระทั่งกับพันธุกรรมมนุษย์",
        "effect": {
            "econ": 0,
            "dipl": 0,
            "govt": 0,
            "scty": 10
        }
    },
    {
        "question": "เราควรเปิดพรมแดนต้อนรับผู้อพยพ",
        "effect": {
            "econ": 0,
            "dipl": 10,
            "govt": 10,
            "scty": 0
        }
    },
    {
        "question": "รัฐบาลควรห่วงใยและดูแลชาวต่างชาติเช่นเดียวกับพลเมืองของตัวเอง",
        "effect": {
            "econ": 0,
            "dipl": 10,
            "govt": 0,
            "scty": 0
        }
    },
    {
        "question": "คนทุกหมู่เหล่า ไม่ว่าจะมีปัจจัยที่แตกต่างกัน มีวัฒนธรรมแบบไหน หรือเพศใด ก็ควรได้รับการปฏิบัติต่ออย่างเท่าเทียม",
        "effect": {
            "econ": 10,
            "dipl": 10,
            "govt": 10,
            "scty": 10
        }
    },
    {
        "question": "ถือเป็นสิ่งที่สำคัญที่เราจะผลักดันเป้าหมายของกลุ่มเราเหนือกลุ่มอื่นๆ",
        "effect": {
            "econ": -10,
            "dipl": -10,
            "govt": -10,
            "scty": -10
        }
    }
];
